/*  
السؤال 5: تحقق من مثلث قائم الزاوية
اكتب برنامجًا يطلب من المستخدم إدخال أطوال ثلاثة أضلاع:
 a, b, c
 ثم يتحقق هل هو مثلث قائم الزاوية أم لا.
🔹 تلميح:
 مثلث قائم الزاوية يتحقق من قانون فيثاغورس:
 [
 c^2 = a^2 + b^2
 ]
 (مع التأكد من أي ضلع هو الأكبر)
*/

#include <iostream>
using namespace std;

int main () {


    double a,b,c;
    cout << "ادخل طول الضلع الاول: ";
    cin >> a;       
    cout << "ادخل طول الضلع الثاني: ";
    cin >> b;
    cout << "ادخل طول الضلع الثالث: ";
    cin >> c;

    if 
    ( (c*c == a*a + b*b) ||  (a*a == b*b + c*c) ||   (b*b == a*a + c*c) ) 
    {
        cout << "المثلث قائم الزاوية" << endl;
    } 
    else 
    {
        cout << "المثلث ليس قائم الزاوية" << endl;
    }

    return 0;
}