/*
السؤال 6: إدخال متكرر لحساب عدة مثلثات
اكتب برنامجًا يتيح للمستخدم حساب مساحة عدة مثلثات.
 كل مرة يطلب base و height ويحسب المساحة.
 يتوقف فقط عندما يُدخل المستخدم 0 كقيمة للقاعدة.
🔹 استخدم: while loop.
🔹 تلميح: 


 */
#include <iostream>
using namespace std;
int main () {
    double base, height;
    while (true) {
        cout << "ادخل قاعدة المثلث : ";
        cin >> base;
        if (base == 0) {      // توقف إذا كانت القاعدة 0
            break;
        }
        cout << "ادخل ارتفاع المثلث: ";
        cin >> height;
        double area = 0.5 * base * height;
        cout << "مساحة المثلث هي: " << area << endl;
    }
    return 0;
}