/*  


السؤال 7: اكتب برنامجًا يطلب رقم n ويطبع الشكل التالي (على شكل هرم مزدوج):
   *
   ***
  *****
 *******
*********
 *******
  *****
   ***
    *

*/

#include <iostream>
using namespace std;
int main () {
    int n;
    cout << "ادخل رقم n: ";
    cin >> n;

    // الجزء العلوي من الهرم
    for (int i = 1; i <= n; i++) {
        // طباعة الفراغات
        for (int j = i; j < n; j++) {
            cout << " ";
        }
        // طباعة النجوم
        for (int k = 1; k <= (2 * i - 1); k++) {
            cout << "*";
        }
        cout << endl;
    }


// فوققققق 





// تحتتتتتتت

    // الجزء السفلي من الهرم
    for (int i = n - 1; i >= 1; i--) {
        // طباعة الفراغات
        for (int j = n; j > i; j--) {
            cout << " ";
        }
        // طباعة النجوم
        for (int k = 1; k <= (2 * i - 1); k++) {
            cout << "*";
        }
        cout << endl;
    }

    return 0;
}
