/*
🧩 السؤال 6: مجموع الأعداد التي تقبل القسمة على 3
📝 الوصف:
 اطلب من المستخدم إدخال رقم N،
 ثم احسب مجموع كل الأرقام من 1 إلى N التي تقبل القسمة على 3.
🔹 المطلوب:
 for loop + if (i % 3 == 0)*/

 // مع طباعة المجموع في النهاية


#include <iostream>
using namespace std;
int main ()
{
    int N ;
    cout << " please enter a number  " << endl;
    cin >> N ;

    int sum = 0 ;
// حساب المجموع
    for ( int i = 1 ; i <= N ; i++ )
    {
        if ( i % 3 == 0 )
        {
            sum = sum + i ;
        }
    } 
    
    
    
        //  وطاعة عدد الارقام التي تقبل القسمة على 3   عرض مجموع الارقام من واحد الى  n 
    
    cout << " The sum of numbers between 1 and " << N << " that are divisible by 3 is: " << sum << endl;

cout << endl ;

    return 0 ;
}




